LoRaWanMiniMouse/Mini-Mouse/stm32L4FROMST/McuApi/ClassSTM32L4.cpp
/*
 __  __ _       _                                 
 |  \/  (_)     (_)                                
 | \  / |_ _ __  _ _ __ ___   ___  _   _ ___  ___  
 | |\/| | | '_ \| | '_ ` _ \ / _ \| | | / __|/ _ \
 | |  | | | | | | | | | | | | (_) | |_| \__ \  __/ 
 |_|  |_|_|_| |_|_|_| |_| |_|\___/ \__,_|___/\___| 
                                                   
                                                   
Description       : Flash Api.  


License           : Revised BSD License, see LICENSE.TXT file include in the project

Maintainer        : Fabien Holin (SEMTECH)
*/
#include "ClassSTM32L4.h"
#include "stdint.h"
#include "ApiMcu.h"
#include "stm32l4xx_hal.h"
#include "time.h"
#include "spi.h"
#include "rtc.h"
#include "gpio.h"
#include "usart.h"
#include "stm32l4xx_it.h"
#include "lptim.h"
#include "main.h"
#include "wwdg.h"
#include "iwdg.h"
#include "UserDefine.h"
#if DEBUG_TRACE == 1
    #include <stdarg.h>
    #include <string.h>
#endif
#define WATCH_DOG_PERIOD_RELEASE 30 // this period have to be lower than the Watch Dog period of 32 seconds




__STATIC_INLINE uint32_t LL_SPI_IsActiveFlag_TXE(SPI_TypeDef *SPIx)
{
  return (READ_BIT(SPIx->SR, SPI_SR_TXE) == (SPI_SR_TXE));
}

__STATIC_INLINE void LL_SPI_TransmitData8(SPI_TypeDef *SPIx, uint8_t TxData)
{
  *((__IO uint8_t *)&SPIx->DR) = TxData;
}

__STATIC_INLINE uint32_t LL_SPI_IsActiveFlag_RXNE(SPI_TypeDef *SPIx)
{
  return (READ_BIT(SPIx->SR, SPI_SR_RXNE) == (SPI_SR_RXNE));
}

__STATIC_INLINE uint8_t LL_SPI_ReceiveData8(SPI_TypeDef *SPIx)
{
  return (uint8_t)(READ_REG(SPIx->DR));
}

/********************************************************************/
/*                           Flash local functions                  */
/********************************************************************/
#define DATA_EEPROM_BASE       ( ( uint32_t )0x8000000 )              /*!< DATA_EEPROM base address in the alias region */
#define DATA_EEPROM_END        ( ( uint32_t )DATA_EEPROM_BASE + 4096 ) /*!< DATA EEPROM end address in the alias region */

/**
  * @brief  This function does an erase of all user flash area
  * @param  bank_active: start of user flash area
  * @retval FLASHIF_OK : user flash area successfully erased
  *         FLASHIF_ERASEKO : error occurred
  */
enum
{
    FLASHIF_OK = 0,
    FLASHIF_ERASEKO,
    FLASHIF_WRITINGCTRL_ERROR,
    FLASHIF_WRITING_ERROR,
    FLASHIF_CRCKO,
    FLASHIF_RECORD_ERROR,
    FLASHIF_EMPTY,
    FLASHIF_PROTECTION_ERRROR
};

enum{
    FLASHIF_PROTECTION_NONE         = 0,
    FLASHIF_PROTECTION_PCROPENABLED = 0x1,
    FLASHIF_PROTECTION_WRPENABLED   = 0x2,
    FLASHIF_PROTECTION_RDPENABLED   = 0x4,
};

/* protection update */
enum {
    FLASHIF_WRP_ENABLE,
    FLASHIF_WRP_DISABLE
};
uint32_t BankActive = 0, BFSysMem = 0;
FLASH_OBProgramInitTypeDef OBConfig;
/* Notable Flash addresses */
#define FLASH_START_BANK1             ((uint32_t)0x08000000)
#define FLASH_START_BANK2             ((uint32_t)0x08080000)
#define USER_FLASH_END_ADDRESS        ((uint32_t)0x08100000)

#define NVIC_VT_FLASH_B2           FLASH_START_BANK1
#define NVIC_VT_FLASH_B1           FLASH_START_BANK2

uint32_t FLASH_If_Erase(uint32_t bank_active)
{
    uint32_t bank_to_erase, error = 0;
    FLASH_EraseInitTypeDef pEraseInit;
    HAL_StatusTypeDef status = HAL_OK;
    if (bank_active == 0) {
        bank_to_erase = FLASH_BANK_2;
    } else {
        bank_to_erase = FLASH_BANK_1;
    }
    /* Unlock the Flash to enable the flash control register access *************/
    HAL_FLASH_Unlock();
    pEraseInit.Banks = bank_to_erase;
    pEraseInit.NbPages = 255;
    pEraseInit.Page = 0;
    pEraseInit.TypeErase = FLASH_TYPEERASE_MASSERASE;
    status = HAL_FLASHEx_Erase(&pEraseInit, &error);

    /* Lock the Flash to disable the flash control register access (recommended
     to protect the FLASH memory against possible unwanted operation) *********/
    HAL_FLASH_Lock();
    if (status != HAL_OK) {
    /* Error occurred while page erase */
        return FLASHIF_ERASEKO;
    }
    return FLASHIF_OK;
}

/**
  * @brief  This function does an CRC check of an application loaded in a memory bank.
  * @param  start: start of user flash area
  * @retval FLASHIF_OK: user flash area successfully erased
  *         other: error occurred
  */
uint32_t FLASH_If_Check(uint32_t start)
{
    /* checking if the data could be code (first word is stack location) */
    if ((*(uint32_t*)start >> 24) != 0x20 ) return FLASHIF_EMPTY;
    return FLASHIF_OK;
}

/**
  * @brief  This function writes a data buffer in flash (data are 32-bit aligned).
  * @note   After writing data buffer, the flash content is checked.
  * @param  destination: start address for target location
  * @param  p_source: pointer on buffer with data to write
  * @param  length: length of data buffer (unit is 32-bit word)
  * @retval uint32_t 0: Data successfully written to Flash memory
  *         1: Error occurred while writing data in Flash memory
  *         2: Written Data in flash memory is different from expected one
  */
uint32_t FLASH_If_Write(uint32_t destination, uint32_t *p_source, uint32_t length)
{
    uint32_t status = FLASHIF_OK;
    uint32_t i = 0;

    /* Unlock the Flash to enable the flash control register access *************/
    HAL_FLASH_Unlock();

    /* DataLength must be a multiple of 64 bit */
    for (i = 0; (i < length / 2) && (destination <= (USER_FLASH_END_ADDRESS - 8)); i++) {
        /* Device voltage range supposed to be [2.7V to 3.6V], the operation will
           be done by word */
        if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, destination, *((uint64_t *)(p_source + 2*i))) == HAL_OK) {
          /* Check the written value */
            if (*(uint64_t*)destination != *(uint64_t *)(p_source + 2*i)) {
            /* Flash content doesn't match SRAM content */
                status = FLASHIF_WRITINGCTRL_ERROR;
                break;
            }
          /* Increment FLASH destination address */
            destination += 8;
        } else {
          /* Error occurred while writing data in Flash memory */
            status = FLASHIF_WRITING_ERROR;
            break;
        }
    }

    /* Lock the Flash to disable the flash control register access (recommended
     to protect the FLASH memory against possible unwanted operation) *********/
    HAL_FLASH_Lock();
    return status;
}

/**
  * @brief  Configure the write protection status of user flash area.
  * @retval uint32_t FLASHIF_OK if change is applied.
  */
uint32_t FLASH_If_WriteProtectionClear( void ) {
    FLASH_OBProgramInitTypeDef OptionsBytesStruct1;
    /* Unlock the Flash to enable the flash control register access *************/
    HAL_FLASH_Unlock();
    /* Unlock the Options Bytes *************************************************/
    HAL_FLASH_OB_Unlock();
    OptionsBytesStruct1.RDPLevel = OB_RDP_LEVEL_0;
    OptionsBytesStruct1.OptionType = OPTIONBYTE_WRP;
    OptionsBytesStruct1.WRPArea = OB_WRPAREA_BANK2_AREAA;
    OptionsBytesStruct1.WRPEndOffset = 0x00;
    OptionsBytesStruct1.WRPStartOffset = 0xFF;
    HAL_FLASHEx_OBProgram(&OptionsBytesStruct1);
    OptionsBytesStruct1.WRPArea = OB_WRPAREA_BANK2_AREAB;
    HAL_FLASHEx_OBProgram(&OptionsBytesStruct1);
    return (0);
}

/**
  * @brief  Modify the BFB2 status of user flash area.
  * @param  none
  * @retval HAL_StatusTypeDef HAL_OK if change is applied.
  */
HAL_StatusTypeDef FLASH_If_BankSwitch(void)
{
    FLASH_OBProgramInitTypeDef ob_config;
    HAL_StatusTypeDef result;
    HAL_FLASH_Lock();
    /* Clear OPTVERR bit set on virgin samples */
    __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_OPTVERR);
    /* Get the current configuration */
    HAL_FLASHEx_OBGetConfig( &ob_config );
    ob_config.OptionType = OPTIONBYTE_USER;
    ob_config.USERType = OB_USER_BFB2;
    if ((ob_config.USERConfig) & (OB_BFB2_ENABLE)) {
        ob_config.USERConfig = OB_BFB2_DISABLE;
    } else {
        ob_config.USERConfig = OB_BFB2_ENABLE;
    }

    /* Initiating the modifications */
    result = HAL_FLASH_Unlock();
    /* program if unlock is successful */
    if ( result == HAL_OK ) {
        result = HAL_FLASH_OB_Unlock();
    /* program if unlock is successful*/
        if ((READ_BIT(FLASH->CR, FLASH_CR_OPTLOCK) == RESET)) {
            result = HAL_FLASHEx_OBProgram(&ob_config);
        }
        if (result == HAL_OK) {
            HAL_FLASH_OB_Launch();
        }
    }
    return result;
}


void FlashPageErase( uint32_t page, uint32_t banks )
{
    // Check the parameters
    assert_param( IS_FLASH_PAGE( page ) );
    assert_param( IS_FLASH_BANK_EXCLUSIVE( banks ) );
    if( ( banks & FLASH_BANK_1 ) != RESET ) {
        CLEAR_BIT( FLASH->CR, FLASH_CR_BKER );
    } else {
        SET_BIT( FLASH->CR, FLASH_CR_BKER );
    }
    // Proceed to erase the page
    MODIFY_REG( FLASH->CR, FLASH_CR_PNB, ( page << 3 ) );
    SET_BIT( FLASH->CR, FLASH_CR_PER );
    SET_BIT( FLASH->CR, FLASH_CR_STRT );
}

uint8_t EepromMcuWriteBuffer( uint32_t addr, uint8_t *buffer, uint16_t size )
{   
    HAL_StatusTypeDef status = HAL_OK; 
    uint64_t *flash = ( uint64_t* )buffer;
    uint32_t Findpage = (addr - 0x8000000 )>>11;
    uint32_t NumberOfPage = (size >> 11)+1;	
    HAL_FLASH_Unlock( );
    for (uint32_t i = 0 ; i < NumberOfPage; i ++){
        FlashPageErase( Findpage + i, 1 );
    }
    WRITE_REG( FLASH->CR, 0x40000000 );
    for( uint32_t i = 0; i < size; i++ )
    {
        if (HAL_FLASH_Program( FLASH_TYPEPROGRAM_DOUBLEWORD, addr + ( 8 * i ), flash[i] ) == HAL_OK)
        {
            /* Check the written value */
            if (*(uint64_t*)(addr + ( 8 * i )) != flash[i])
            {
            /* Flash content doesn't match SRAM content */
                status = HAL_ERROR;
                break;
            }
        } else {
           /* Error occurred while writing data in Flash memory */
            status = HAL_ERROR;
            break;
        }
    }
    HAL_FLASH_Lock( );
    return status;
}

uint8_t EepromMcuReadBuffer( uint32_t addr, uint8_t *buffer, uint16_t size )
{
    assert_param( buffer != NULL ); 
    //assert_param( addr >= DATA_EEPROM_BASE );
    assert_param( buffer != NULL );
    assert_param( size < ( DATA_EEPROM_END - DATA_EEPROM_BASE ) );
    for( uint32_t i = 0; i < size; i++ ) {
        buffer[i]= *((( uint8_t* )addr)+i);
    }
    return SUCCESS;
}

void EepromMcuSetDeviceAddr( uint8_t addr )
{
    assert_param( FAIL );
}

uint8_t EepromMcuGetDeviceAddr( void )
{
    assert_param( FAIL );
    return 0;
}


