LoRaWanMiniMouse/Mini-Mouse/stm32L4FROMST/McuApi/ClassSTM32L4.cpp
/********************************************************************/
/*                         Wake Up local functions                  */
/********************************************************************/
static RTC_HandleTypeDef RtcHandle;


/*!
 * Irq Handler dedicated for wake up It
 * 
 * \param [IN]  void
 * \param [OUT] void         
 */




/*!
* WakeUpAlarmMSecond : Configures the application wake up timer with a delay duration in ms
 * When the timer expires , the rtc block generates an It to wake up the Mcu 
 * \remark this function is not used by the LoRaWAN object, only provided for application purposes.
 * \param [IN]  int delay in ms
 * \param [OUT] void         
 */

void WakeUpAlarmMSecond ( int delay) {
    int DelayMs2tick = delay * 2 + ( ( 6 * delay ) >> 7);
    HAL_RTCEx_SetWakeUpTimer_IT(&RtcHandle, DelayMs2tick, RTC_WAKEUPCLOCK_RTCCLK_DIV16);
}
/*!
* WakeUpAlarmMecond : Configure the wake up timer with a delay duration in second
 * \remark this function is not used by the LoRaWAN object, only provided for application purposes.
 * When the timer expires , the rtc block generates an It to wake up the Mcu 
 * 
 * \param [IN]  int delay in s
 * \param [OUT] void         
 */
void WakeUpAlarmSecond ( int delay) {
    HAL_RTCEx_SetWakeUpTimer_IT(&RtcHandle, delay, 4);
}



/********************************************************************/
/*                 Low Power Timer local functions                  */
/********************************************************************/

/*!
 * Irq Handler dedicated for Low power Timer reserved for lorawan layer
 *\remark LowPowerTimerLora.timerISR() is used to callback the timer Interupt Service Routine of the current obj LoraWanObject 
 * \param [IN]  void
 * \param [OUT] void         
 */




/********************************************************************/
/*                        Gpio Handler  functions                   */
/********************************************************************/

void  IrqHandlerRadio ( void ){
    int pintmp = TX_RX_IT;
    if ( pintmp < 15 ) {
        HAL_GPIO_EXTI_IRQHandler( (1 << pintmp) );
    } else if ( pintmp < 31 ) {
        HAL_GPIO_EXTI_IRQHandler( (1 << ( pintmp - 16 )) );
    } else if ( pintmp < 47 ) {
        HAL_GPIO_EXTI_IRQHandler( (1 << ( pintmp - 32 )) );
    } else if ( pintmp < 63 ) {
        HAL_GPIO_EXTI_IRQHandler( (1 << ( pintmp - 48 )) );
    } else if ( pintmp < 79 ) {
        HAL_GPIO_EXTI_IRQHandler( (1 << ( pintmp - 64 )) );
    } else if ( pintmp < 95 ) {
        HAL_GPIO_EXTI_IRQHandler( (1 << ( pintmp - 80 )) );
    } else if ( pintmp < 111 ) {
        HAL_GPIO_EXTI_IRQHandler( (1 << ( pintmp - 96 )) );
    } 
    pintmp = RX_TIMEOUT_IT;
    if ( pintmp < 15 ) {
        HAL_GPIO_EXTI_IRQHandler( (1 << pintmp) );
    } else if ( pintmp < 31 ) {
        HAL_GPIO_EXTI_IRQHandler( (1 << ( pintmp - 16 )) );
    } else if ( pintmp < 47 ) {
        HAL_GPIO_EXTI_IRQHandler( (1 << ( pintmp - 32 )) );
    } else if ( pintmp < 63 ) {
        HAL_GPIO_EXTI_IRQHandler( (1 << ( pintmp - 48 )) );
    } else if ( pintmp < 79 ) {
        HAL_GPIO_EXTI_IRQHandler( (1 << ( pintmp - 64 )) );
    } else if ( pintmp < 95 ) {
        HAL_GPIO_EXTI_IRQHandler( (1 << ( pintmp - 80 )) );
    } else if ( pintmp < 111 ) {
        HAL_GPIO_EXTI_IRQHandler( (1 << ( pintmp - 96 )) );
    } 
   
    mcu.ExtISR();
}


    

/*************************************************************/
/*           Mcu Object Definition Constructor               */
/*************************************************************/
McuSTM32L4::McuSTM32L4(PinName mosi, PinName miso, PinName sclk )  {
    Func = DoNothing; // don't modify
    obj = NULL;       // don't modify
    McuMosi = mosi;   // don't modify
    McuMiso = miso;   // don't modify
    McuSclk = sclk;   // don't modify
}     
McuSTM32L4::~McuSTM32L4(){
      // to be completed by mcu providers
} 

/*******************************************/
/*                  Mcu Init               */
/*******************************************/
void McuSTM32L4::InitMcu( void ) {
    // system clk Done with mbed to be completed by mcu providers if mbed is removed
      /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_LPTIM1_Init();
  MX_USART2_UART_Init();
  MX_SPI1_Init();
  MX_RTC_Init();
 // MX_I2C1_Init();
  //MX_WWDG_Init();
  
  
  

    /*For dual boot */
    FLASH_If_WriteProtectionClear();
    /* Test from which bank the program runs */
    /* Bit 8 FB_MODE: Flash Bank mode selection
    0: Flash Bank 1 mapped at 0x0800 0000 (and aliased @0x0000 0000(1)) and Flash Bank 2
    mapped at 0x0808 0000 (and aliased at 0x0008 0000)
    1: Flash Bank2 mapped at 0x0800 0000 (and aliased @0x0000 0000(1)) and Flash Bank 1
    mapped at 0x0808 0000 (and aliased at 0x0008 0000)
            */
    BankActive = READ_BIT(SYSCFG->MEMRMP, SYSCFG_MEMRMP_FB_MODE);
    if (BankActive == 0) { //bank 1
        //DEBUG_MSG("Dual Boot is activated and code running on Bank 1 \n");
    } else {
        //DEBUG_MSG("Dual Boot is activated and code running on Bank 2 \n");
        uint32_t result = FLASH_If_Erase( BankActive ); //Erase the 0x8080000
        if (result == FLASHIF_OK) {
       // DEBUG_MSG("Copying BANK1 to BANK2\n");
        result = FLASH_If_Write( FLASH_START_BANK2, (uint32_t*)FLASH_START_BANK1, 20480);
        }
        if (result != FLASHIF_OK) {
         //   DEBUG_PRINTF("Failure! %d \n",result);
        } else {
          //  DEBUG_MSG("Sucess!\n");
            FLASH_If_BankSwitch();
            NVIC_SystemReset();
        }
    }
}

void  McuSTM32L4::Init_Irq ( PinName pin) {

}    
/******************************************************************************/
/*                                Mcu Spi Api                                 */
/******************************************************************************/
    /** Create a SPI master connected to the specified pins
    *
    *  @param mosi SPI Master Out, Slave In pin
    *  @param miso SPI Master In, Slave Out pin
    *  @param sclk SPI Clock pin
    */

void McuSTM32L4::InitSpi ( ){

