LoRaWanMiniMouse/Mini-Mouse/stm32L4FROMST/McuApi/ClassSTM32L4.cpp
}
    /** Write to the SPI Slave and return the response
    *
    *  @param value Data to be sent to the SPI slave
    *
    *  @returns
    *    Response from the SPI slave
    */
uint8_t McuSTM32L4::SpiWrite(int value){
          uint8_t rxData = 0;
        while( LL_SPI_IsActiveFlag_TXE ( SPI1 ) == 0  ){};
        LL_SPI_TransmitData8 (SPI1, uint8_t (value&0xFF));
        while( LL_SPI_IsActiveFlag_RXNE ( SPI1 ) == 0 ){};
        rxData =  LL_SPI_ReceiveData8( SPI1 );
        return (rxData);
}
/******************************************************************************/
/*                                Mcu Flash Api                               */
/******************************************************************************/
int McuSTM32L4::RestoreContext(uint8_t *buffer, uint32_t addr, uint32_t size){
     /* have to be implemented by mcu providers
    the following code propose a lite implementation without any error cases*/
    uint16_t sizet = size & 0xFFFF;
    EepromMcuReadBuffer( addr, buffer, sizet );
    return ( 0 ); 
}
static uint8_t copyPage [2048] ;
int McuSTM32L4::WriteFlashWithoutErase(uint8_t *buffer, uint32_t addr, uint32_t size){

    int findPage = 0 ;
    uint32_t findByteAdress = 0 ;
    uint32_t findLastAdress = 0 ;
    int status = 0;
    uint32_t i;
    uint32_t flashBaseAdress;    
    uint64_t *flash = ( uint64_t* )copyPage;
    assert_param( buffer != NULL );
    assert_param( size < ( 2048 ) );
    findPage = ((addr - 0x8080000 )) >> 11 ;  // 2048 page size;
    findByteAdress = ( (addr - 0x8080000 )  - ( findPage << 11 ));
    findLastAdress = findByteAdress + size ; //if >2048 across two pages !!
    flashBaseAdress = 0x8080000 ;
    HAL_FLASH_Unlock( );

    for( i = 0; i < 2048; i++ ) {
        copyPage[i]= *(( uint8_t* )(flashBaseAdress + (findPage * 2048))+i);
    }
    FlashPageErase(   findPage, 2 );
    WRITE_REG( FLASH->CR, 0x40000000 );
    if ( findLastAdress < 2048) { // all is done on the same page
        for( i = 0; i < size; i++ ) {
            copyPage[i + findByteAdress] = buffer [i];
        }
        for( i = 0; i < 256; i++ ) {
            status += HAL_FLASH_Program( FLASH_TYPEPROGRAM_DOUBLEWORD, flashBaseAdress + (findPage * 2048) + ( 8 * i ), flash[i] );
        }
    } else { // require 2 pages
        for( i = 0; i < (2048-findByteAdress); i++ ) {
            copyPage[i + findByteAdress] = buffer [i];
        }
        for( i = 0; i < 256; i++ ) {
            status += HAL_FLASH_Program( FLASH_TYPEPROGRAM_DOUBLEWORD, flashBaseAdress + (findPage * 2048) + ( 8 * i ),  flash[i] );
        }
        for( i = 0; i < 2048; i++ ) { //copy the next page
            copyPage[i]= *(( uint8_t* )(flashBaseAdress + ((findPage + 1) * 2048))+i);
        }
        FlashPageErase(   1 + findPage, 2 );
        WRITE_REG( FLASH->CR, 0x40000000 );
        for( i = 0; i < (findLastAdress - 2048); i++ ) {
            copyPage[i ] =  buffer [i + 2048 - findByteAdress ];
        }
        for( i = 0; i < 256; i++ ) {
            status += HAL_FLASH_Program( FLASH_TYPEPROGRAM_DOUBLEWORD, flashBaseAdress + ((findPage + 1) * 2048) + ( 8 * i ),  flash[i] );
        }
    }
    if ( status > 0 ) {
        // DEBUG_MSG("ERROR HAL FLASH \n");
    }
    HAL_FLASH_Lock( );
    return ( 0 ); 
}



int McuSTM32L4::StoreContext(const void *buffer, uint32_t addr, uint32_t size){
    /* have to be implemented by mcu providers
    the following code propose a lite implementation without any error cases
    this section have to be very robust, have to support failure mode such as  power off during flash programmation    
    This basic implementation suppose that the addr is 4 Bytes aligned and suppose also that the size can be divide by 4.
    */
    uint16_t sizet = size & 0xFFFF;
    while ( EepromMcuWriteBuffer( addr,  (uint8_t*) buffer, sizet ) != HAL_OK) { // in case of infinite error watchdog will expire
        mwait_ms ( 300 );
    }
    mwait_ms ( 300 );
    return ( 0 ); 
} 
   


/******************************************************************************/
/*                                Mcu RTC Api                                 */
/******************************************************************************/

void McuSTM32L4::RtcInit (void)
{

}

uint32_t McuSTM32L4::RtcGetTimeMs( void )
{
    RTC_DateTypeDef dateStruct;
    RTC_TimeTypeDef timeStruct;
    struct tm timeinfo;
    RtcHandle.Instance = RTC;
    HAL_RTC_GetTime(&RtcHandle, &timeStruct, FORMAT_BIN);
    HAL_RTC_GetDate(&RtcHandle, &dateStruct, FORMAT_BIN);
    timeinfo.tm_wday = dateStruct.WeekDay;
    timeinfo.tm_mon  = dateStruct.Month ;
    timeinfo.tm_mday = dateStruct.Date;
    timeinfo.tm_year = dateStruct.Year ;
    timeinfo.tm_hour = timeStruct.Hours;
    timeinfo.tm_min  = timeStruct.Minutes;
    timeinfo.tm_sec  = timeStruct.Seconds;
    // Convert to timestamp
    time_t t = mktime(&timeinfo);
    return ( ( t * 1000 ) + ( 999 - ( ( timeStruct.SubSeconds *999) / 255 ) ) );  // get time en ms
}

uint32_t McuSTM32L4::RtcGetTimeSecond( void )
{
    RTC_DateTypeDef dateStruct;
    RTC_TimeTypeDef timeStruct;
    struct tm timeinfo;
    RtcHandle.Instance = RTC;

    HAL_RTC_GetTime(&RtcHandle, &timeStruct, FORMAT_BIN);
    HAL_RTC_GetDate(&RtcHandle, &dateStruct, FORMAT_BIN);
    timeinfo.tm_wday = dateStruct.WeekDay;
    timeinfo.tm_mon  = dateStruct.Month ;
    timeinfo.tm_mday = dateStruct.Date;
    timeinfo.tm_year = dateStruct.Year ;
    timeinfo.tm_hour = timeStruct.Hours;
    timeinfo.tm_min  = timeStruct.Minutes;
    timeinfo.tm_sec  = timeStruct.Seconds;
    time_t t = mktime(&timeinfo);
    return ( t );
}

/******************************************************************************/
/*                                Mcu Sleep Api                               */
/******************************************************************************/
void McuSTM32L4::GotoSleepSecond (int duration ) {
#if LOW_POWER_MODE == 1
    int cpt = duration ;
    while ( cpt > ( WATCH_DOG_PERIOD_RELEASE ) ) {
        cpt -= WATCH_DOG_PERIOD_RELEASE ;
        WakeUpAlarmSecond( WATCH_DOG_PERIOD_RELEASE );
        sleep();
        WatchDogRelease ( );
    }
    WakeUpAlarmSecond( cpt );
    sleep();
# else
    int cpt = duration ;
    WatchDogRelease ( );
    while ( cpt > ( WATCH_DOG_PERIOD_RELEASE ) ) {
        cpt -= WATCH_DOG_PERIOD_RELEASE ;
        mwait( WATCH_DOG_PERIOD_RELEASE );
        WatchDogRelease ( );
    }
    mwait( cpt );
    WatchDogRelease ( );
#endif
}

void McuSTM32L4::GotoSleepMSecond (int duration ) {
#if LOW_POWER_MODE == 1
    WakeUpAlarmMSecond ( duration );
    sleep();
    WatchDogRelease ( );
# else
    mwait_ms ( duration ) ;
    WatchDogRelease ( );
#endif
}


/******************************************************************************/
/*                             Mcu WatchDog Api                               */
/******************************************************************************/

static IWDG_HandleTypeDef Iwdg;

/*!
 * Watch Dog Init And start with a period befor ereset set to 32 seconds
*/
void McuSTM32L4::WatchDogStart ( void ) {
 
