LoRaWanMiniMouse/Mini-Mouse/stm32L4FROMST/McuApi/ClassSTM32L4.cpp
}
/*!
 * Watch Dog Release
*/
void McuSTM32L4::WatchDogRelease ( void ) {
    HAL_IWDG_Refresh(&Iwdg);
};
/******************************************************************************/
/*                             Mcu LOwPower timer Api                         */
/******************************************************************************/
void McuSTM32L4::LowPowerTimerLoRaInit ( ) {

    Func = DoNothing;
    obj = NULL;
    //Initialize delay Systick timer for wait function
    //TM_DELAY_Init();
};
/*!
 * LowPowerTimerLoRa AttachMsecond
 *
 * \param void (* _Func) (void *) a static method member of the current Obj
 * \param *_obj a pointer to the current objet
 * \param int delay in ms delay should be between 1ms and 16s.
 * \param [OUT] void         
 * \remark the code  Func =  _Func ; and obj  = _obj; isn't mcu dependent
 * \remark starts the LoRaWAN dedicated timer and attaches the IRQ to the handling Interupt SErvice Routine in the LoRaWAN object.
 */
void McuSTM32L4::StartTimerMsecond ( void (* _Func) (void *) , void * _obj, int delay){
    Func =  _Func ;
    obj  = _obj;
    int DelayMs2tick = delay * 2 + ( ( 6 * delay ) >> 7);
    HAL_LPTIM_TimeOut_Start_IT(&hlptim1, 65535, DelayMs2tick); // MCU specific
};

/******************************************************************************/
/*                           Mcu Gpio Api                                     */
/******************************************************************************/
void McuSTM32L4::SetValueDigitalOutPin ( PinName Pin, int Value ){
        uint16_t pintmp ;
        if ( Pin < 15 ) {
            pintmp = (uint16_t) Pin;
            HAL_GPIO_WritePin(GPIOA, ( 1 << pintmp ), (GPIO_PinState) Value);
        } else if ( Pin < 31 ) {
            pintmp = (uint16_t)Pin-16;
            HAL_GPIO_WritePin(GPIOB, ( 1 << pintmp ), (GPIO_PinState) Value);
        } else if ( Pin < 47 ) {
            pintmp = Pin-32;
            HAL_GPIO_WritePin(GPIOC, ( 1 << pintmp ), (GPIO_PinState) Value);
        } else if ( Pin < 63 ) {
            pintmp = Pin-48;
          HAL_GPIO_WritePin(GPIOD, ( 1 << pintmp ), (GPIO_PinState) Value);
        } else if ( Pin < 79 ) {
            pintmp = Pin-64;
            HAL_GPIO_WritePin(GPIOE, ( 1 << pintmp ), (GPIO_PinState) Value);
        } else if ( Pin < 95 ) {
            pintmp = Pin-80;
            HAL_GPIO_WritePin(GPIOF, ( 1 << pintmp ), (GPIO_PinState) Value);
        } else  {
            pintmp = Pin-96;
            HAL_GPIO_WritePin(GPIOG, ( 1 << pintmp ), (GPIO_PinState) Value);
        }
};
int McuSTM32L4::GetValueDigitalInPin ( PinName Pin ){
    uint16_t pintmp ;
    if ( Pin < 15 ) {
        pintmp = (uint16_t) Pin;
        return ( (int) HAL_GPIO_ReadPin(GPIOA, ( 1 << pintmp ) ) );
    } else if ( Pin < 31 ) {
        pintmp = (uint16_t)Pin-16;
        return ( (int) HAL_GPIO_ReadPin(GPIOB, ( 1 << pintmp ) ) );
    } else if ( Pin < 47 ) {
        pintmp = Pin-32;
       return ( (int) HAL_GPIO_ReadPin(GPIOC, ( 1 << pintmp ) ) );
    } else if ( Pin < 63 ) {
        pintmp = Pin-48;
      return ( (int) HAL_GPIO_ReadPin(GPIOD, ( 1 << pintmp ) ) );
    } else if ( Pin < 79 ) {
        pintmp = Pin-64;
        return ( (int) HAL_GPIO_ReadPin(GPIOE, ( 1 << pintmp ) ) );
    } else if ( Pin < 95 ) {
        pintmp = Pin-80;
        return ( (int) HAL_GPIO_ReadPin(GPIOF, ( 1 << pintmp ) ) );
    } else {
        pintmp = Pin-96;
        return ( (int) HAL_GPIO_ReadPin(GPIOG, ( 1 << pintmp ) ) );
    }
};


void  McuSTM32L4::AttachInterruptIn       (  void (* _Funcext) (void *) , void * _objext) {
    Funcext =  _Funcext ;
    objext  = _objext;
    userIt  = 0 ; 
};

/******************************************************************************/
/*                           Mcu Uart Api                                     */
/******************************************************************************/

 

void vprint(const char *fmt, va_list argp)
{
#if DEBUG_TRACE == 1
    char string[200];
    if(0 < vsprintf(string,fmt,argp)) // build string
    {
        HAL_UART_Transmit(&huart2, (uint8_t*)string, strlen(string), 0xffffff); // send message via UART
    }
#endif
}



void McuSTM32L4::UartInit ( void ) {
#if DEBUG_TRACE == 1
  
#endif
};
void McuSTM32L4::MMprint( const char *fmt, ...){
#if DEBUG_TRACE == 1
  va_list argp;
  va_start(argp, fmt);
  vprint(fmt, argp);
  va_end(argp);
#endif
};
